Revit 2026 API

# IPointCloudAccessFree Method

---

Completes the lifetime of the object providing this interface.

**Namespace:** Autodesk.Revit.DB.PointClouds**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
void Free()
```
```vb
Sub Free
```
```cpp
void Free()
```
```fsharp
abstract Free : unit -> unit
```

Calling this function indicates that the IPointCloudAccess interface is not going to be used after the call returns, and the provider of the interface can dispose of all allocated resources.

#### Reference

IPointCloudAccess Interface

Autodesk.Revit.DB.PointClouds Namespace